tests/webhook_payloads/invoice-with-item-discounts.json

{
  "invoice": {
    "includes_package_tracking_info": false,
    "chatlet_count": 0,
    "can_send_in_mail": false,
    "zcrm_potential_id": "",
    "discount": 0,
    "taxes": [
      {
        "tax_amount": 15080.5,
        "tax_name": "PDV - 20 (20%)",
        "tax_amount_formatted": "RSD15,080.50"
      }
    ],
    "is_client_review_settings_enabled": false,
    "billing_address": {
      "zip": "",
      "country": "Serbia",
      "address": "Adresa 2",
      "city": "Bajmok",
      "phone": "",
      "street": "Adresa 2",
      "attention": "",
      "street2": "",
      "state": "",
      "fax": ""
    },
    "line_items": [
      {
        "discount_amount_formatted": "RSD1,572.50",
        "bcy_rate": 15725,
        "item_total_formatted": "RSD14,152.50",
        "salesorder_item_id": "",
        "line_item_id": "11978000004920023",
        "rate_formatted": "RSD15,725.00",
        "header_id": "",
        "documents": [],
        "discount_amount": 1572.5,
        "item_type": "sales",
        "item_type_formatted": "Sales Items",
        "purchase_rate": "",
        "description": "",
        "discount": "10%",
        "item_order": 0,
        "zoho_recruit_jobopening_id": "",
        "discounts": [],
        "rate": 15725,
        "project_id": "",
        "pricebook_id": "",
        "bcy_rate_formatted": "RSD15,725.00",
        "quantity": 1,
        "image_document_id": "",
        "item_id": "11978000000177386",
        "expense_receipt_name": "",
        "tax_name": "PDV - 20",
        "item_total": 14152.5,
        "header_name": "",
        "item_custom_fields": [],
        "tax_id": "11978000000035003",
        "unit": "",
        "purchase_rate_formatted": "",
        "cost_amount": 0,
        "tax_type": "tax",
        "time_entry_ids": [],
        "cost_amount_formatted": "RSD0.00",
        "name": "Ekskluziv+ 100",
        "tax_percentage": 20,
        "expense_id": ""
      },
      {
        "discount_amount_formatted": "RSD3,750.00",
        "bcy_rate": 25000,
        "item_total_formatted": "RSD21,250.00",
        "salesorder_item_id": "",
        "line_item_id": "11978000004920025",
        "rate_formatted": "RSD25,000.00",
        "header_id": "",
        "documents": [],
        "discount_amount": 3750,
        "item_type": "sales",
        "item_type_formatted": "Sales Items",
        "purchase_rate": "",
        "description": "popust 15%",
        "discount": "15%",
        "item_order": 1,
        "zoho_recruit_jobopening_id": "",
        "discounts": [],
        "rate": 25000,
        "project_id": "",
        "pricebook_id": "",
        "bcy_rate_formatted": "RSD25,000.00",
        "quantity": 1,
        "image_document_id": "",
        "item_id": "11978000000177482",
        "expense_receipt_name": "",
        "tax_name": "PDV - 20",
        "item_total": 21250,
        "header_name": "",
        "item_custom_fields": [],
        "tax_id": "11978000000035003",
        "unit": "",
        "purchase_rate_formatted": "",
        "cost_amount": 0,
        "tax_type": "tax",
        "time_entry_ids": [],
        "cost_amount_formatted": "RSD0.00",
        "name": "Paket kredita 5000",
        "tax_percentage": 20,
        "expense_id": ""
      },
      {
        "discount_amount_formatted": "RSD10,000.00",
        "bcy_rate": 50000,
        "item_total_formatted": "RSD40,000.00",
        "salesorder_item_id": "",
        "line_item_id": "11978000004920027",
        "rate_formatted": "RSD50,000.00",
        "header_id": "",
        "documents": [],
        "discount_amount": 10000,
        "item_type": "sales",
        "item_type_formatted": "Sales Items",
        "purchase_rate": "",
        "description": "popust 20%",
        "discount": "20%",
        "item_order": 2,
        "zoho_recruit_jobopening_id": "",
        "discounts": [],
        "rate": 50000,
        "project_id": "",
        "pricebook_id": "",
        "bcy_rate_formatted": "RSD50,000.00",
        "quantity": 1,
        "image_document_id": "",
        "item_id": "11978000000177490",
        "expense_receipt_name": "",
        "tax_name": "PDV - 20",
        "item_total": 40000,
        "header_name": "",
        "item_custom_fields": [],
        "tax_id": "11978000000035003",
        "unit": "",
        "purchase_rate_formatted": "",
        "cost_amount": 0,
        "tax_type": "tax",
        "time_entry_ids": [],
        "cost_amount_formatted": "RSD0.00",
        "name": "Paket kredita 10000",
        "tax_percentage": 20,
        "expense_id": ""
      },
      {
        "discount_amount_formatted": "RSD3,145.00",
        "bcy_rate": 15725,
        "item_total_formatted": "RSD28,305.00",
        "salesorder_item_id": "",
        "line_item_id": "11978000004927058",
        "rate_formatted": "RSD15,725.00",
        "header_id": "",
        "documents": [],
        "discount_amount": 3145,
        "item_type": "sales",
        "item_type_formatted": "Sales Items",
        "purchase_rate": "",
        "description": "",
        "discount": "10%",
        "item_order": 0,
        "zoho_recruit_jobopening_id": "",
        "discounts": [],
        "rate": 15725,
        "project_id": "",
        "pricebook_id": "",
        "bcy_rate_formatted": "RSD15,725.00",
        "quantity": 2,
        "image_document_id": "",
        "item_id": "11978000000177386",
        "expense_receipt_name": "",
        "tax_name": "PDV - 20",
        "item_total": 28305,
        "header_name": "",
        "item_custom_fields": [],
        "tax_id": "11978000000035003",
        "unit": "",
        "purchase_rate_formatted": "",
        "cost_amount": 0,
        "tax_type": "tax",
        "time_entry_ids": [],
        "cost_amount_formatted": "RSD0.00",
        "name": "Ekskluziv+ 100",
        "tax_percentage": 20,
        "expense_id": ""
      }
    ],
    "payment_expected_date_formatted": "",
    "balance": 124448.4,
    "bcy_shipping_charge_tax": "",
    "terms": "",
    "credits_applied": 0,
    "credits_applied_formatted": "RSD0.00",
    "invoice_number": "inv019203",
    "payment_options": {
      "payment_gateways": []
    },
    "sub_total_inclusive_of_tax": 0,
    "stop_reminder_until_payment_expected_date": false,
    "customer_default_billing_address": {
      "zip": "",
      "country": "Serbia",
      "address": "Adresa 2",
      "city": "Bajmok",
      "phone": "",
      "street2": "",
      "state": "",
      "fax": "",
      "state_code": ""
    },
    "inprocess_transaction_present": false,
    "exchange_rate": 1,
    "approver_id": "",
    "submitted_date_formatted": "",
    "estimate_id": "",
    "merchant_name": "",
    "sales_channel": "direct_sales",
    "customer_custom_fields": [],
    "shipping_charge_formatted": "RSD0.00",
    "status_formatted": "Draft",
    "reference_number": "TEST-INVOICE",
    "shipping_charge_tax_id": "",
    "ecomm_operator_name": "",
    "is_autobill_enabled": false,
    "discount_percent": 16.88895,
    "shipping_charge_tax_name": "",
    "page_height": "11.69in",
    "status": "draft",
    "discount_total": 15322.5,
    "reader_offline_payment_initiated": false,
    "schedule_time_formatted": "",
    "tax_total": 15080.5,
    "adjustment_formatted": "RSD0.00",
    "balance_formatted": "RSD124,448.4.00",
    "write_off_amount": 0,
    "is_viewed_by_client": false,
    "salesorder_id": "",
    "currency_code": "RSD",
    "page_width": "8.27in",
    "sub_statuses": [],
    "bcy_total": 124448.4,
    "last_reminder_sent_date_formatted": "",
    "date_formatted": "14 Feb 2022",
    "client_viewed_time_formatted": "",
    "email": "aleksandra.grahovac@4zida.rs",
    "tax_rounding": "entity_level",
    "salesorders": [],
    "adjustment_description": "Adjustment",
    "last_modified_time": "2022-02-14T12:29:10+0100",
    "currency_symbol": "RSD",
    "ach_supported": false,
    "shipping_bills": [],
    "discount_type": "item_level",
    "transaction_rounding_type": "no_rounding",
    "roundoff_value": 0,
    "contact_persons_details": [
      {
        "phone": "",
        "mobile": "+38169123456",
        "last_name": "Kontakt",
        "contact_person_id": "11978000000028133",
        "is_primary_contact": true,
        "photo_url": "https://secure.gravatar.com/avatar/5ab813aa6beef1812f3ef1fa5adac460?&d=mm",
        "first_name": "Demo profil agencije",
        "email": "aleksandra.grahovac@4zida.rs"
      }
    ],
    "template_name": "Standard Template",
    "deliverychallans": [],
    "schedule_time": "",
    "salesorder_number": "",
    "template_id": "11978000000000103",
    "customer_name": "Demo profil agencije",
    "customer_id": "11978000000028119",
    "roundoff_value_formatted": "RSD0.00",
    "total_formatted": "RSD124,448.4.00",
    "unused_retainer_payments_formatted": "RSD0.00",
    "discount_total_formatted": "RSD15,322.50",
    "payment_terms_label": "Due on Receipt",
    "show_no_of_copies": true,
    "date": "2022-02-14",
    "submitted_date": "",
    "template_type_formatted": "Standard",
    "notes": "Thanks for your business.",
    "late_fee": {
      "amount": 0,
      "rate_formatted": "RSD0.00",
      "rate": 0,
      "name": "",
      "amount_formatted": "RSD0.00",
      "frequency_type": "month",
      "type": "percentage"
    },
    "documents": [],
    "client_viewed_time": "",
    "ecomm_operator_id": "",
    "shipping_charge_inclusive_of_tax": 0,
    "last_modified_by_id": "11978000001789003",
    "write_off_amount_formatted": "RSD0.00",
    "payment_discount_formatted": "RSD0.00",
    "invoice_id": "11978000004920021",
    "contact_category": "",
    "template_type": "standard",
    "recurring_invoice_id": "",
    "color_code": "",
    "can_send_invoice_sms": true,
    "contact_persons": [
      "11978000000028133"
    ],
    "shipping_charge_tax": "",
    "bcy_tax_total": 15080.5,
    "created_time": "2022-02-14T12:29:10+0100",
    "created_date_formatted": "14 Feb 2022",
    "last_payment_date_formatted": "",
    "is_inclusive_tax": false,
    "custom_fields": [],
    "last_payment_date": "",
    "price_precision": 2,
    "sub_total_inclusive_of_tax_formatted": "RSD0.00",
    "payment_discount": 0,
    "current_sub_status_formatted": "Draft",
    "approvers_list": [],
    "shipping_charge_tax_percentage": "",
    "zcrm_potential_name": "",
    "adjustment": 0,
    "created_by_id": "11978000001789003",
    "is_backorder": "",
    "current_sub_status": "draft",
    "due_date_formatted": "14 Feb 2022",
    "offline_created_date_with_time_formatted": "",
    "is_discount_before_tax": true,
    "shipping_charge_inclusive_of_tax_formatted": "RSD0.00",
    "attachment_name": "",
    "ach_payment_initiated": false,
    "last_reminder_sent_date": "",
    "merchant_id": "",
    "payment_terms": 0,
    "shipping_charge_exclusive_of_tax": 0,
    "total": 124448.4,
    "shipping_charge_exclusive_of_tax_formatted": "RSD0.00",
    "tax_total_formatted": "RSD15,080.50",
    "current_sub_status_id": "",
    "custom_field_hash": {},
    "sub_total_formatted": "RSD75,402.50",
    "tax_amount_withheld": 0,
    "tax_amount_withheld_formatted": "RSD0.00",
    "bcy_shipping_charge": 0,
    "shipping_address": {
      "zip": "",
      "country": "",
      "address": "",
      "city": "",
      "phone": "",
      "street": "",
      "attention": "",
      "street2": "",
      "state": "",
      "fax": ""
    },
    "next_reminder_date_formatted": "",
    "shipping_charge_tax_formatted": "",
    "bcy_discount_total": 15322.5,
    "shipping_charge_tax_type": "",
    "orientation": "portrait",
    "discount_applied_on_amount": 0,
    "due_date": "2022-02-14",
    "submitter_id": "",
    "submitted_by": "",
    "subject_content": "",
    "no_of_copies": 1,
    "payment_made_formatted": "RSD0.00",
    "bcy_sub_total": 75402.5,
    "payment_expected_date": "",
    "is_emailed": false,
    "reminders_sent": 0,
    "unused_retainer_payments": 0,
    "offline_created_date_with_time": "",
    "salesperson_name": "Marko Krstajić ",
    "salesperson_id": "11978000001804003",
    "payment_made": 0,
    "shipping_charge": 0,
    "bcy_adjustment": 0,
    "sub_total": 75402.5,
    "allow_partial_payments": false,
    "created_date": "2022-02-14",
    "customer_custom_field_hash": {},
    "currency_id": "11978000000024026",
    "invoice_url": "https://zohosecurepay.eu/invoice/4zida/secure?CInvoiceID=2-f0bc870eaead59fc71085839a359b77ed870cefd58b53ee3b4ef0e07582dec8b123dd5006b0d2951775e202398053a3f2f86f2926671c2efa55646d41e48edff11e80a707f5b3196 ",
    "payment_reminder_enabled": true
  }
}
